from frozendict import frozendict

DICT = frozendict({
    'hello': '👋 Привет, {name}! Спасибо, что обратился ко мне 🤖'
             'Давай разберемся с твоей проблемой, выбери ее из списка ниже:',
    'get_location_manual': 'Пожалуйста, укажите место обращения:',
    'fix_1': 'Ничего страшного, возможно они застряли. Попробуйте достать '
             'их рукой 😊',
    'fix_1_accept': 'Спасибо что обратился ко мне, рад был помочь 😊',
    'fix_1_decline': 'Спасибо за обращение, сейчас я свяжусь с тобой'
                     ' для возврата денежных средств',
    'fix_2': 'Спасибо, что предупредил об этом! '
             'Cкоро приедет специалист и устранит неисправность'
})
