from frozendict import frozendict

DICT = frozendict({
    'hello': '👋 Привет, {name}! Я бот - помощник. '
             'Давай разберемся с твоей проблемой, выбери ее из списка ниже:',
    'get_location_manual': 'Пожалуйста, укажите место обращения:',
    'problem_1': 'Автомат не выдал фото',
    'problem_2': 'Автомат выдал только одно фото',
    'problem_3': 'Автомат выдал чужое фото',
    'problem_4': 'Автомат не принимает купюры',
    'problem_5': 'Не вижу себя на экране',
    'problem_6': 'Не вижу QR для оплаты',
    'problem_7': 'После оплаты ничего не происходит',
    'problem_8': 'Не горит экран',
    'problem_9': 'Не работает сенсор',
    'problem_10': 'Вместо фото черный квадрат',
    'sorry': 'Упсс.. Кажется, я сломался 😔 Приносим свои извинения. '
             'С Вами свяжется администратор для возврата денег',
    'sorry_3': 'Извините, что так получилось😔 Попробуйте оплатить еще раз. '
               'С вами свяжется администратор для возврата денег за чужие '
               'фотографии.',
    'goodbye': 'Рад был помочь, {name}! Если возникнут вопросы, '
               'обращайтесь к нам снова. Мы всегда рады помочь!',
    'problem_1_1': 'Вы вышли из фотобудки? У нас фотографии печатаются снаружи',
    'goodbye_4': 'Упсс.. Кажется, я сломался 😔 Спасибо {name}, что сообщил '
                 'о проблеме! Попробуй оплатить с помощью QR-кода. ',
    'problem_4_1': 'К сожаления я не могу принимать сильно мятые купюры и '
                   'купюры нового образца, попробуйте оплатить другой купюрой.'
                   ' Если хотите оформить возврат, выберите кнопку ниже:',
    'problem_6_1': 'Благодарю за обращение! Возможно, у нас что-то сломалось, '
                   'мы в процессе решения проблемы. Попробуйте оплатить '
                   'наличными.',
})
